IRP/src/Documents/ExternalAccountingOperation/ExternalAccountingOperation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>ExternalAccountingOperation</name>
 <registerRecords>AccumulationRegister.T1050T_AccountingQuantities</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <attributes>
  <name>RecorderRef</name>
  <type>
   <types>UUID</types>
  </type>
 </attributes>
 <attributes>
  <name>RecorderPresentation</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>RecorderURL</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>200</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>RecorderName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>IsOpeningEntry</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>AccountingCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>DocumentCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Records</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Period</name>
   <type>
    <types>Date</types>
   </type>
  </attributes>
  <attributes>
   <name>Activity</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>CompanyRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>CompanyPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>10</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountDrRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountDrPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AccountDr</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyDrRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyDrPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>10</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyDr</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>AmountCurrencyDr</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityDr</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountCrRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountCrPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AccountCr</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyCrRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyCrPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>10</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyCr</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>AmountCurrencyCr</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityCr</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>OperationTitle</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>1024</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ChartNameDr</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ChartNameCr</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefDr1</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeDr1</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueDr1</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefDr2</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeDr2</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueDr2</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefDr3</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeDr3</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueDr3</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefCr1</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeCr1</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueCr1</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefCr2</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeCr2</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueCr2</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefCr3</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeCr3</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueCr3</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Errors</name>
  <attributes>
   <name>Error</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>1024</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Documents/ExternalAccountingOperation/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	QueryArray = GetQueryTextsSecondaryTables();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);

	AccountingServer.CreateAccountingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo);

	Tables = New Structure;	
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);

	Tables.T1040T_AccountingAmounts.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	Tables.T1050T_AccountingQuantities.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map;
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region Posting_Info

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure;
	StrParams.Insert("Ref", Ref);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	QueryArray.Add(Records());
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(T1040T_AccountingAmounts());
	QueryArray.Add(T1050T_AccountingQuantities());
	Return QueryArray;
EndFunction

#EndRegion

#Region Posting_SourceTable

Function Records()
	Return
		"SELECT
		|	DocRecords.Period,
		|	DocRecords.Key,
		|	DocRecords.Currency,
		|	DocRecords.Amount,
		|	DocRecords.CurrencyDr AS DrCurrency,
		|	DocRecords.AmountCurrencyDr AS DrCurrencyAmount,
		|	DocRecords.CurrencyCr AS CrCurrency,
		|	DocRecords.AmountCurrencyCr AS CrCurrencyAmount,
		|	CASE
		|		WHEN DocRecords.QuantityDr <> 0
		|			THEN DocRecords.QuantityDr
		|		ELSE DocRecords.QuantityCr
		|	END AS Quantity
		|INTO Records
		|FROM
		|	Document.ExternalAccountingOperation.Records AS DocRecords
		|WHERE
		|	DocRecords.Ref = &Ref";	
EndFunction

#EndRegion

#Region Posting_MainTables

#EndRegion

#Region AccessObject

// Get access key.
// 
// Parameters:
//  Obj - DocumentObjectDocumentName -
// 
// Returns:
//  Map
Function GetAccessKey(Obj) Export
	AccessKeyMap = New Map;
	AccessKeyMap.Insert("Company", Obj.Company);
	Return AccessKeyMap;
EndFunction

#EndRegion

#Region Accounting

Function T1040T_AccountingAmounts()
	Return
		"SELECT
		|	Records.Period,
		|	Records.Key AS RowKey,
		|	Records.Key AS Key,
		|	Records.Currency,
		|	Records.Amount,
		|	Records.DrCurrency,
		|	Records.DrCurrencyAmount,
		|	Records.CrCurrency,
		|	Records.CrCurrencyAmount,
		|	VALUE(Catalog.AccountingOperations.ExternalAccountingOperation) AS Operation,
		|	UNDEFINED AS AdvancesClosing
		|INTO T1040T_AccountingAmounts
		|FROM
		|	Records AS Records
		|WHERE
		|	TRUE";
EndFunction

Function T1050T_AccountingQuantities()
	Return 
		"SELECT
		|	Records.Period,
		|	Records.Key AS RowKey,
		|	VALUE(Catalog.AccountingOperations.ExternalAccountingOperation) AS Operation,
		|	Records.Quantity
		|INTO T1050T_AccountingQuantities
		|FROM
		|	Records AS Records
		|WHERE
		|	Records.Quantity <> 0";
EndFunction

Function GetAccountingAnalytics(Parameters) Export
	AO = Catalogs.AccountingOperations;
	
	If Parameters.Operation = AO.ExternalAccountingOperation Then
		Return GetAnalytics_ExternalAccountingOperation(Parameters);
	EndIf;
	
	Return Undefined;
EndFunction

#Region Accounting_Analytics

Function GetAnalytics_ExternalAccountingOperation(Parameters)
	AccountingAnalytics = AccountingServer.GetAccountingAnalyticsResult(Parameters);
	AccountParameters   = AccountingServer.GetAccountParameters(Parameters);

	// Debit
	AccountingAnalytics.Debit = Parameters.RowData.AccountDr;
	
	AdditionalAnalyticsDr = New Structure();
	AdditionalAnalyticsDr.Insert("ExtDimDr1", Parameters.RowData.InternalExtDimensionValueDr1);
	AdditionalAnalyticsDr.Insert("ExtDimDr2", Parameters.RowData.InternalExtDimensionValueDr2);
	AdditionalAnalyticsDr.Insert("ExtDimDr3", Parameters.RowData.InternalExtDimensionValueDr3);
				                                               
	AccountingServer.SetDebitExtDimensions(Parameters, AccountingAnalytics, AdditionalAnalyticsDr);

	// Credit
	AccountingAnalytics.Credit = Parameters.RowData.AccountCr;
	
	AdditionalAnalyticsCr = New Structure();
	AdditionalAnalyticsCr.Insert("ExtDimCr1", Parameters.RowData.InternalExtDimensionValueCr1);
	AdditionalAnalyticsCr.Insert("ExtDimCr2", Parameters.RowData.InternalExtDimensionValueCr2);
	AdditionalAnalyticsCr.Insert("ExtDimCr3", Parameters.RowData.InternalExtDimensionValueCr3);
	
	AccountingServer.SetCreditExtDimensions(Parameters, AccountingAnalytics, AdditionalAnalyticsCr);
	
	If ValueIsFilled(AccountingAnalytics.LedgerType.SourceLedgerType) Then
		Return MatchAnalytics(Parameters, AccountingAnalytics, AccountingAnalytics.LedgerType.SourceLedgerType);
	EndIf;
	
	Return AccountingAnalytics;
EndFunction

Function GetHintDebitExtDimension(Parameters, ExtDimensionType, Value, AdditionalAnalytics, Number) Export
	Return Value;
EndFunction

Function GetHintCreditExtDimension(Parameters, ExtDimensionType, Value, AdditionalAnalytics, Number) Export
	Return Value;
EndFunction

Function MatchAnalytics(Parameters, SourceAnalytics, SourceLedgerType)
	AccountingAnalytics = AccountingServer.GetAccountingAnalyticsResult(Parameters);
	AccountParameters   = AccountingServer.GetAccountParameters(Parameters);

	// Debit
	AccountingAnalytics.Debit = MatchAccount(SourceAnalytics.Debit, 
											 SourceAnalytics.DebitExtDimensions,
											 SourceLedgerType, 
											 SourceAnalytics.LedgerType);
	
	AdditionalAnalyticsDr = New Structure();
	AdditionalAnalyticsDr.Insert("ExtDimDr1", Parameters.RowData.InternalExtDimensionValueDr1);
	AdditionalAnalyticsDr.Insert("ExtDimDr2", Parameters.RowData.InternalExtDimensionValueDr2);
	AdditionalAnalyticsDr.Insert("ExtDimDr3", Parameters.RowData.InternalExtDimensionValueDr3);
				                                               
	AccountingServer.SetDebitExtDimensions(Parameters, AccountingAnalytics, AdditionalAnalyticsDr);

	// Credit
	AccountingAnalytics.Credit = MatchAccount(SourceAnalytics.Credit, 
											  SourceAnalytics.CreditExtDimensions,
											  SourceLedgerType, 
											  SourceAnalytics.LedgerType); 

	AdditionalAnalyticsCr = New Structure();
	AdditionalAnalyticsCr.Insert("ExtDimCr1", Parameters.RowData.InternalExtDimensionValueCr1);
	AdditionalAnalyticsCr.Insert("ExtDimCr2", Parameters.RowData.InternalExtDimensionValueCr2);
	AdditionalAnalyticsCr.Insert("ExtDimCr3", Parameters.RowData.InternalExtDimensionValueCr3);
	
	AccountingServer.SetCreditExtDimensions(Parameters, AccountingAnalytics, AdditionalAnalyticsCr);
	
	Return AccountingAnalytics;	
EndFunction

Function MatchAccount(SourceAccount, ExtDimensions, SourceLedgerType, TargetLedgerType)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	Reg.TargetAccount
	|FROM
	|	InformationRegister.T9068S_AccountingMappingAccountsMatching AS Reg
	|WHERE
	|	Reg.SourceLedgerType = &SourceLedgerType
	|	AND Reg.TargetLedgerType = &TargetLedgerType
	|	AND Reg.SourceAccount = &SourceAccount
	|	AND (CASE
	|		WHEN Reg.AllExtDimensionValues1
	|			THEN TRUE
	|		ELSE Reg.ExtDimensionValue1 = &ExtDimensionValue1
	|	END
	|	AND CASE
	|		WHEN Reg.AllExtDimensionValues2
	|			THEN TRUE
	|		ELSE Reg.ExtDimensionValue2 = &ExtDimensionValue2
	|	END
	|	AND CASE
	|		WHEN Reg.AllExtDimensionValues3
	|			THEN TRUE
	|		ELSE Reg.ExtDimensionValue3 = &ExtDimensionValue3
	|	END)";
	
	Query.SetParameter("SourceLedgerType", SourceLedgerType);
	Query.SetParameter("TargetLedgerType", TargetLedgerType);
	Query.SetParameter("SourceAccount", SourceAccount);
	
	ExtDimensionType1 = AccountingServer.GetExtDimType_ByNumber(1, SourceAccount);
	ExtDimensionValue1 = Undefined;
	If ValueIsFilled(ExtDimensionType1) Then
		ExtDimensionValue1 = GetExtDimensionValue(ExtDimensionType1, ExtDimensions);
	EndIf;
	Query.SetParameter("ExtDimensionValue1", ExtDimensionValue1);
	
	ExtDimensionType2 = AccountingServer.GetExtDimType_ByNumber(2, SourceAccount);
	ExtDimensionValue2 = Undefined;
	If ValueIsFilled(ExtDimensionType2) Then
		ExtDimensionValue2 = GetExtDimensionValue(ExtDimensionType2, ExtDimensions);
	EndIf;
	Query.SetParameter("ExtDimensionValue2", ExtDimensionValue2);
	
	ExtDimensionType3 = AccountingServer.GetExtDimType_ByNumber(3, SourceAccount);
	ExtDimensionValue3 = Undefined;
	If ValueIsFilled(ExtDimensionType3) Then
		ExtDimensionValue3 = GetExtDimensionValue(ExtDimensionType3, ExtDimensions);
	EndIf;
	Query.SetParameter("ExtDimensionValue3", ExtDimensionValue3);
		
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	If QuerySelection.Next() Then
		Return QuerySelection.TargetAccount;
	EndIf;
	
	Return Undefined;
EndFunction

Function GetExtDimensionValue(ExtDimensionType, ExtDimensions)
	For Each Row In ExtDimensions Do
		If Row.ExtDimensionType = ExtDimensionType Then
			Return Row.ExtDimension;
		EndIf;
	EndDo;
	Return Undefined;
EndFunction

#EndRegion

#EndRegion
